app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params.require(:comment).permit(:body))
    #sets comment's post_id to the @post id
    @comment.creator = User.first #TODO: fix after authentication

    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "comments" ("body", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "hello there"], ["post_id", 1], ["user_id", 1], ["created_at", "2018-04-30 22:26:15.009073"], ["updated_at", "2018-04-30 22:26:15.009073"]]