app/controllers/posts_controller.rb

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("title", "url", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "some title"], ["url", "some post"], ["description", "some desc"], ["user_id", 1], ["created_at", "2018-04-21 23:10:00.103123"], ["updated_at", "2018-04-21 23:10:00.103123"]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = User.first #TODO: change once we have authentication

    if @post.save